daycare_portal_api/app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def create
    @activity = Activity.new(activity_params)

    if @activity.save
---
INSERT INTO "activities" ("breakfast", "morningActivity", "lunch", "napStartTime", "napEndTime", "afternoonSnack", "date", "created_at", "updated_at", "child_id", "teacher_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def set_activity
      @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]