daycare_portal_api/app/controllers/parents_controller.rb

SELECT "parents".* FROM "parents"
---
  def index
    @parents = Parent.all

SELECT "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_parent
      @parent = Parent.find(params[:id])